In [1]:
import faiss
import numpy as np

import pandas as pd

from tools.embedding import FastTextTableEmbedder

In [2]:
table = [['Hello', 'World', 5], ['I am', 'Giovanni', 23]]
pd.DataFrame(table)

       0         1   2
0  Hello     World   5
1   I am  Giovanni  23

In [3]:
tabenc = FastTextTableEmbedder('/data4/nanni/tesi-magistrale/models/fasttext/cc.en.300.bin')

Warning : `load_model` does not return WordVectorModel or SupervisedModel any more, but a `FastText` object which is very similar.

In [32]:
from tools.utils.utils import get_mongodb_collections, get_one_document_from_mongodb_by_key, _create_token_set


mongoclient, collections = get_mongodb_collections(small=False)

In [30]:
results = pd.read_csv('/data4/nanni/tesi-magistrale/data/tests/main_test/results/extracted/final_results_q1K.csv')
results.head(10)

,query_id,result_id,algorithm,mode,algorithm_overlap,sloth_overlap,query_size,res_tab_size,intersection_mode_size
0,308921,873174.0,josie,set,4.0,4.0,6.0,32.0,4.0
1,308921,867275.0,josie,set,4.0,4.0,6.0,36.0,4.0
2,308921,308894.0,josie,set,4.0,4.0,6.0,6.0,4.0
3,308921,2471596.0,josie,set,3.0,3.0,6.0,61.0,3.0
4,308921,2212408.0,josie,set,3.0,3.0,6.0,72.0,3.0
5,308921,143455.0,josie,set,3.0,3.0,6.0,19.0,3.0
6,308921,1322101.0,josie,set,3.0,3.0,6.0,29.0,3.0
7,308921,1321709.0,josie,set,3.0,3.0,6.0,62.0,3.0
8,308921,308888.0,josie,set,3.0,3.0,6.0,6.0,3.0
9,308921,2653888.0,josie,set,3.0,3.0,6.0,48.0,3.0

In [8]:
qdoc = get_one_document_from_mongodb_by_key('_id_numeric', 2, *collections)

In [10]:
pd.DataFrame(qdoc['content'])

                                    0         1
0                        Chart (1987)  Position
1         Canada Top Albums/CDs (RPM)        70
2           Dutch Albums (MegaCharts)        61
3     European Albums (Music & Media)        33
4                French Albums (SNEP)        63
5  German Albums (Offizielle Top 100)        42
6                     UK Albums (OCC)        15

In [33]:
rdoc = get_one_document_from_mongodb_by_key('_id_numeric', 873174, *collections)

pd.DataFrame(rdoc['content'])

                 0         1          2
0             Club  Champion  Runner-up
1          América         6          3
2             León         5          4
3           Puebla         5          3
4      Guadalajara         4          8
5        Cruz Azul         4          2
6           Necaxa         4          1
7            Atlas         4          1
8             UANL         3          1
9          Atlante         2          4
10        Veracruz         2          3
11       Monterrey         2          2
12       Zacatepec         2          2
13          Toluca         2          2
14  Tampico Madero         1          2
15            UdeG         1          2
16         Morelia         1          2
17       Querétaro         1          0
18   Santos Laguna         1          0
19         Sinaloa         1          0
20     Real España         1          0
21       Moctezuma         1          0
22            UNAM         1          0
23             Oro         0          1
24        Irapuato         0          1
25         Torreón         0          1
26          Cobras         0          1
27      Toros Neza         0          1
28             UAT         0          1
29          Oaxaca         0          1
30         Pachuca         0          1
31          Juárez         0          1

In [34]:
len(_create_token_set(rdoc['content'], 'set', rdoc['numeric_columns']))

32